<template>
  <HomeSectionWrapper>
    <h2>Часті запитання</h2>
    <el-collapse v-model="activeNames" class="mb-25">
      <el-collapse-item
        v-for="(item, index) in faqItems"
        :key="index"
        :title="item.title"
        :name="index + 1"
      >
        <p class="body-2 p-3.5">{{ item.content }}</p>
      </el-collapse-item>
    </el-collapse>
  </HomeSectionWrapper>
</template>

<script setup lang="ts">
import HomeSectionWrapper from '@/views/home-page/components/HomeSectionWrapper.vue'

const activeNames = ref([])
const faqItems = [
  {
    title: 'Як відбувається процес купівлі?',
    content: `Процес купівлі автомобіля на нашому сайті є простим та зручним. 
      Ви починаєте з перегляду нашого каталогу автомобілів,
      де можете фільтрувати за маркою, моделлю, ціною та іншими параметрами. 
      Знайшовши потрібний автомобіль, ви переходите на його
      сторінку для перегляду детальної інформації та фотографій. 
      Для оформлення покупки вам потрібно зв'язатися з продавцем, та узгодити деталі.
      Після підтвердження угоди, ви отримаєте всі необхідні 
      документи та інформацію для організації передачі автомобіля.`
  },
  {
    title: 'Як перевірити надійність продавця?',
    content: `Щоб перевірити надійність продавця на нашому сайті, 
      зверніть увагу на рейтинг та відгуки попередніх покупців.
      Кожен продавець має профіль, в якому зазначені його оцінки та коментарі. 
      Рекомендуємо ознайомитися з історією продажів,
      щоб переконатися в надійності та досвіді продавця. 
      Також ми пропонуємо систему захисту покупців, яка забезпечує повернення коштів
      у разі виникнення проблем з угодою.`
  },
  {
    title: 'В яких країнах дійсний ваш сервіс?',
    content: `Наш сервіс доступний у багатьох країнах, включаючи Україну, США та більшість країн Європи.
      Ми постійно розширюємо нашу географію, щоб забезпечити зручний доступ до 
      купівлі та продажу автомобілів для клієнтів з усього світу.
      Ви можете перевірити доступність сервісу у вашій країні під час оформлення замовлення.`
  },
  {
    title: 'Які переваги вашого сервісу?',
    content: `Наш сервіс має кілька ключових переваг. По-перше, ми пропонуємо великий 
      вибір автомобілів за конкурентоспроможними цінами,
      включаючи нові та б/у моделі. По-друге, наша платформа забезпечує 
      зручний інтерфейс, що спрощує пошук і купівлю автомобілів.
      Ми також піклуємося про безпеку наших користувачів, впроваджуючи надійні
      методи оплати та систему захисту покупців. Нарешті,
      ми надаємо підтримку клієнтів 24/7, готові відповісти на будь-які ваші 
      запитання та допомогти в разі необхідності.`
  }
]

</script>
